//DZ-2
//Дайте ответ, что будет в результате выполнения данных ниже примеров. С объяснением, почему это так.

//1) кот" > "код" отв: true - первые символы равны, по таблице unicode т>д
//2)"2" + 2 * "2" отв: 24 - сначала 2 * '2'(происходит приведение '2' к типу number
//будет 4, далее "2"+4 конкатенация строк  )
//3) undefined == null отв: true - это специальное правило языка
//4). undefined != null отв: false - это специальное правило языка
//5) null == 0  отв: false -  null эквив +0, +0!=0
//6) 2 > "3" отв: false - "3" преобраз в number, а 2<3
//7) null - false + true отв: 1 - преобраз к number: 0-0+1
//8)  1 / "l" отв: NaN, тк при пробраз строки к числу произойдет ошибка преобраз
//9) "2" * "3" отв: 6 - произойдет преобраз из строки в числа
//10)  4 + 5 + "O" отв: 9О - сначала сложение чисел, затем конкатенация строк
//11)"l" + 4 + 5 отв: l45 - произойдет конкатенация, будет "l4", затем еще раз конкатенация
//12) "4" - 2 отв: 2 - 4 преобразуется в число, произойдет вычитание
//13) "4" - "4x" отв: NaN, т.к. не удастся преобраз'4x' к числу
//14) “23” == 23 отв: true, тк при нестрогом равенстве “23” преобраз к числу
//15) null == false отв: false false эквивало +0. однако null не эквивалентно  +0. При преобразовании null в числовое значение оно автоматически преобразуется в +0, что приводит к тому, что выражение +null == false возвращает true
//16)  " -4 "/ 0 + 1 отв: -Infinity 4 преобраз к числу, 4/0 бесконечность
//17) null + 1 отве:1 null преобраз к 0
//18) undefined + null ответ NAN - undefined не преобраз к числку
//19) 1 === “1” отв: false - разные типы данных
//20) “2” > 10 отв: false - 2 преобраз к числу, 2>10
//21) NaN == undefined отв: false Nan не преобраз к числу, underfined = Nan Nan!=Nan

//-----------------------------------------------------------------------

console.log('Работа с if-else');
console.log();
///////////////////////////////////////////////////
console.log(
    '1. Если переменная a равна нулю, то выведите Верно, иначе выведите Неверно',
);

let a = 0;
console.log('a = ', a);

if (a === 0) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    "2. Если переменная a больше нуля, то выведите 'Верно', иначе выведите 'Неверно'.",
);

a = 1;
console.log('a = ', a);

if (a > 0) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    "3. Если переменная a меньше нуля, то выведите 'Верно', иначе выведите 'Неверно'.",
);

a = 0;
console.log('a = ', a);

if (a < 0) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    "4. Если переменная a больше или равна нулю, то выведите'Верно', иначе выведите 'Неверно'.",
);

a = -1;
console.log('a = ', a);

if (a >= 0) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    " 5.Если переменная a меньше или равна нулю, то выведите 'Верно', иначе выведите 'Неверно'. ",
);

a = -1;
console.log('a = ', a);

if (a <= 0) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    "6. Если переменная a не равна нулю, то выведите 'Верно', иначевыведите 'Неверно'.",
);

a = -1;
console.log('a = ', a);

if (a != 0) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    "7. Если переменная a равна 'test', то выведите 'Верно', иначе выведите 'Неверно'",
);

a = 'test';
console.log('a = ', a);

if (a === 'test') {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////
console.log(
    "8. Если переменная a равна '1' и по значению и по типу, то выведите 'Верно', иначе выведите 'Неверно'",
);

a = 1;
console.log('a = ', a);

if (a === '1') {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();
///////////////////////////////////////////////////

console.log('---------------------------------------------------------');

console.log('Работа с логическими переменными');
console.log();

///////////////////////////////////////////////////

console.log(
    "Если переменная test равна true, то выведите 'Верно', иначевыведите 'Неверно'.  Напишите два варианта скрипта - с короткойзаписью и с длинной",
);

let test = true;

console.log('test = ', test);

if (test === true) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
let result = test === true ? true : false;
console.log(result);
console.log();
///////////////////////////////////////////////////

console.log(
    "Если переменная test не равна true, то выведите 'Верно',иначе выведите 'Неверно'.  Напишите два варианта скрипта - с короткой записью и с длинной.",
);

test = true;

console.log('test = ', test);

if (test != true) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
result = test != true ? true : false;
console.log(result);
console.log();
///////////////////////////////////////////////////

console.log('---------------------------------------------------------');

console.log('Работа с && (и) и || (или)');
console.log();

///////////////////////////////////////////////////

console.log(
    "1 Если переменная a больше нуля и меньше 5-ти, то выведите'Верно', иначе выведите 'Неверно'",
);

a = 5;

console.log('a = ', a);

if (0 < a && a < 5) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();

///////////////////////////////////////////////////

console.log(
    '2 Если переменная a равна нулю или равна двум, то прибавьтек ней 7, иначе поделите ее на 10. Выведите новое значениепеременной на экран',
);

a = 5;

console.log('a = ', a);

if (a === 0 || a === 2) {
    a += 7;
} else {
    a /= 10;
}
console.log('После условия a = ', a);
console.log();

///////////////////////////////////////////////////

console.log(
    '3 Если переменная a равна или меньше 1, а переменная bбольше или равна 3, то выведите сумму этих переменных,иначе выведите их разность (результат вычитания)',
);

a = 3;
let b = 1;

console.log('a = ', a);
console.log('b = ', b);

if (a <= 0 && b >= 3) {
    console.log('сумма = ', a + b);
} else {
    console.log('разность = ', a - b);
}
console.log();

///////////////////////////////////////////////////

console.log(
    "4. Если переменная a больше 2-х и меньше 11-ти, илипеременная b больше или равна 6-ти и меньше 14-ти, товыведите 'Верно', в противном случае выведите 'Неверно'.",
);

a = 4;
b = 7;

console.log('a = ', a);
console.log('b = ', b);

if ((a > 2 && a < 11) || (b >= 6 && b < 14)) {
    console.log('Верно');
} else {
    console.log('Неверно');
}
console.log();

///////////////////////////////////////////////////

console.log('---------------------------------------------------------');

console.log('На switch-case');
console.log();

///////////////////////////////////////////////////
console.log(
    "1. Переменная num может принимать 4 значения: 1, 2, 3 или 4.Если она имеет значение '1', то в переменную result запишем'зима', если имеет значение '2' – 'весна' и так далее.",
);
let num = 3;
console.log('num = ', num);

switch (num) {
    case 1:
        console.log('зима');
        break;

    case 2:
        console.log('весна');
        break;
    case 3:
        console.log('лето');
        break;
    case 4:
        console.log('осень');
        break;

    default:
        console.log('нет таких значений');
}

console.log('---------------------------------------------------------');

console.log('Общие задачи');
console.log();

//////////////////////////////////////////////////

console.log(
    '1. В переменной day лежит какое-то число из интервала от 1 до31. Определите в какую декаду месяца попадает это число (вервую, вторую или третью).',
);

const day = 20;
console.log('day = ', day);

if (1 <= day && day <= 10) {
    console.log('первая декада');
} else if (11 <= day && day <= 20) {
    console.log('вторая декада');
} else if (21 <= day && day <= 31) {
    console.log('третья декада');
}
console.log();
//////////////////////////////////////////////////

console.log(
    'В переменной month лежит какое-то число из интервала от 1до 12. Определите в какую пору года попадает этот месяц(зима, лето, весна, осень',
);

let month = 10;
console.log('month = ', month);

if ((1 <= month && month <= 2) || month === 12) {
    console.log('зима');
} else if (3 <= month && month <= 5) {
    console.log('весна');
} else if (6 <= month && month <= 8) {
    console.log('лето');
} else if (9 <= month && month <= 11) {
    console.log('осень');
}
console.log();

console.log('---------------------------------------------------------');

console.log('Циклы while и for');
console.log();

//////////////////////////////////////////////////
console.log('1. Выведите столбец чисел от 1 до 100.');

console.log('while');
let counter = 0;
while (counter < 100) {
    counter++;
    console.log(counter);
}

console.log('for');
for (let i = 1; i <= 100; i++) {
    console.log(i);
}

//////////////////////////////////////////////////
console.log('2. Выведите столбец чисел от 11 до 33.');

console.log('while');
counter = 10;
while (counter < 33) {
    counter++;
    console.log(counter);
}

console.log('for');
for (let i = 11; i <= 33; i++) {
    console.log(i);
}

//////////////////////////////////////////////////
console.log('3. Выведите столбец четных чисел в промежутке от 0 до 100.');

console.log('while');
counter = 0;

while (counter <= 100) {
    if (counter % 2 === 0) {
        console.log(counter);
    }
    counter++;
}

console.log('for');
for (let i = 0; i <= 100; i++) {
    if (counter % 2 === 0) {
        console.log(i);
    }
}

//////////////////////////////////////////////////
console.log('4. С помощью цикла найдите сумму чисел от 1 до 100.');

console.log('while');
counter = 0;
let summa_while = 0;

while (counter <= 100) {
    summa_while += counter;
    counter++;
}
console.log(summa_while);

console.log('for');
let summa_for = 0;

for (let i = 0; i <= 100; i++) {
    summa_for += i;
}

console.log(summa_for);

console.log('---------------------------------------------------------');

console.log('Задачи общие');
console.log();

//////////////////////////////////////////////////
console.log(
    'Дано число n=1000. Делите его на 2 столько раз, покарезультат деления не станет меньше 50. Какое числополучится? Посчитайте количество итераций, необходимыхдля этого (итерация - это проход цикла), изапишите его впеременную num',
);

let n = 1000;
let numb = 0;
while (n >= 50) {
    n /= 2;
    numb++;
}
console.log(numb);